benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-cal-38780.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms  700.88us   7.93ms   67.76%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.41ms
 75.000%    1.90ms
 90.000%    2.46ms
 99.000%    3.33ms
 99.900%    4.18ms
 99.990%    6.11ms
 99.999%    7.59ms
100.000%    7.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.048     0.000000            2         1.00
       0.639     0.100000        34926         1.11
       0.873     0.200000        69913         1.25
       1.074     0.300000       104722         1.43
       1.248     0.400000       139618         1.67
       1.412     0.500000       174685         2.00
       1.494     0.550000       192019         2.22
       1.582     0.600000       209474         2.50
       1.676     0.650000       226876         2.86
       1.780     0.700000       244373         3.33
       1.898     0.750000       261742         4.00
       1.967     0.775000       270511         4.44
       2.044     0.800000       279194         5.00
       2.135     0.825000       287997         5.71
       2.231     0.850000       296721         6.67
       2.335     0.875000       305341         8.00
       2.395     0.887500       309683         8.89
       2.465     0.900000       314145        10.00
       2.539     0.912500       318453        11.43
       2.623     0.925000       322789        13.33
       2.713     0.937500       327182        16.00
       2.759     0.943750       329297        17.78
       2.811     0.950000       331493        20.00
       2.867     0.956250       333672        22.86
       2.933     0.962500       335873        26.67
       3.011     0.968750       338054        32.00
       3.053     0.971875       339149        35.56
       3.095     0.975000       340212        40.00
       3.137     0.978125       341287        45.71
       3.181     0.981250       342410        53.33
       3.227     0.984375       343487        64.00
       3.249     0.985938       344017        71.11
       3.277     0.987500       344581        80.00
       3.307     0.989062       345127        91.43
       3.341     0.990625       345654       106.67
       3.391     0.992188       346203       128.00
       3.421     0.992969       346471       142.22
       3.459     0.993750       346750       160.00
       3.499     0.994531       347011       182.86
       3.547     0.995313       347287       213.33
       3.601     0.996094       347556       256.00
       3.627     0.996484       347689       284.44
       3.657     0.996875       347835       320.00
       3.693     0.997266       347965       365.71
       3.745     0.997656       348099       426.67
       3.819     0.998047       348235       512.00
       3.861     0.998242       348302       568.89
       3.929     0.998437       348370       640.00
       4.017     0.998633       348439       731.43
       4.099     0.998828       348507       853.33
       4.187     0.999023       348577      1024.00
       4.239     0.999121       348609      1137.78
       4.311     0.999219       348643      1280.00
       4.423     0.999316       348677      1462.86
       4.531     0.999414       348711      1706.67
       4.715     0.999512       348746      2048.00
       4.795     0.999561       348762      2275.56
       4.883     0.999609       348779      2560.00
       4.967     0.999658       348797      2925.71
       5.075     0.999707       348813      3413.33
       5.219     0.999756       348830      4096.00
       5.327     0.999780       348839      4551.11
       5.427     0.999805       348847      5120.00
       5.531     0.999829       348856      5851.43
       5.703     0.999854       348864      6826.67
       5.899     0.999878       348873      8192.00
       5.991     0.999890       348877      9102.22
       6.119     0.999902       348881     10240.00
       6.271     0.999915       348886     11702.86
       6.439     0.999927       348890     13653.33
       6.539     0.999939       348894     16384.00
       6.595     0.999945       348897     18204.44
       6.603     0.999951       348898     20480.00
       6.815     0.999957       348901     23405.71
       6.855     0.999963       348903     27306.67
       7.035     0.999969       348905     32768.00
       7.191     0.999973       348906     36408.89
       7.207     0.999976       348907     40960.00
       7.251     0.999979       348908     46811.43
       7.423     0.999982       348909     54613.33
       7.455     0.999985       348910     65536.00
       7.515     0.999986       348911     72817.78
       7.515     0.999988       348911     81920.00
       7.591     0.999989       348912     93622.86
       7.591     0.999991       348912    109226.67
       7.763     0.999992       348913    131072.00
       7.763     0.999993       348913    145635.56
       7.763     0.999994       348913    163840.00
       7.859     0.999995       348914    187245.71
       7.859     0.999995       348914    218453.33
       7.859     0.999996       348914    262144.00
       7.859     0.999997       348914    291271.11
       7.859     0.999997       348914    327680.00
       7.931     0.999997       348915    374491.43
       7.931     1.000000       348915          inf
#[Mean    =        1.491, StdDeviation   =        0.701]
#[Max     =        7.928, Total count    =       348915]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  348943 requests in 10.00s, 43.26MB read
Requests/sec:  34889.89
Transfer/sec:      4.33MB