benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-peakfind.txt
Running 15s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 4963.296ms, rate sampling interval: 18169ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.45s     1.35s   14.93s    57.85%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.45s
 75.000%   13.62s
 90.000%   14.32s
 99.000%   14.77s
 99.900%   14.88s
 99.990%   14.93s
 99.999%   14.93s
100.000%   14.93s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9969.663     0.000000            6         1.00
   10592.255     0.100000        20071         1.11
   11059.199     0.200000        39855         1.25
   11517.951     0.300000        59309         1.43
   11993.087     0.400000        79385         1.67
   12451.839     0.500000        98863         2.00
   12689.407     0.550000       108931         2.22
   12918.783     0.600000       118705         2.50
   13148.159     0.650000       128468         2.86
   13385.727     0.700000       138582         3.33
   13615.103     0.750000       148353         4.00
   13729.791     0.775000       153202         4.44
   13852.671     0.800000       158382         5.00
   13967.359     0.825000       163214         5.71
   14082.047     0.850000       168094         6.67
   14196.735     0.875000       172998         8.00
   14254.079     0.887500       175427         8.89
   14319.615     0.900000       178189        10.00
   14376.959     0.912500       180630        11.43
   14434.303     0.925000       183050        13.33
   14491.647     0.937500       185458        16.00
   14524.415     0.943750       186840        17.78
   14548.991     0.950000       187893        20.00
   14581.759     0.956250       189283        22.86
   14606.335     0.962500       190320        26.67
   14639.103     0.968750       191667        32.00
   14655.487     0.971875       192312        35.56
   14671.871     0.975000       192909        40.00
   14688.255     0.978125       193478        45.71
   14704.639     0.981250       194014        53.33
   14729.215     0.984375       194735        64.00
   14737.407     0.985938       194971        71.11
   14745.599     0.987500       195189        80.00
   14761.983     0.989062       195603        91.43
   14770.175     0.990625       195791       106.67
   14786.559     0.992188       196133       128.00
   14794.751     0.992969       196289       142.22
   14802.943     0.993750       196440       160.00
   14811.135     0.994531       196582       182.86
   14827.519     0.995313       196836       213.33
   14835.711     0.996094       196950       256.00
   14835.711     0.996484       196950       284.44
   14843.903     0.996875       197059       320.00
   14852.095     0.997266       197151       365.71
   14860.287     0.997656       197239       426.67
   14868.479     0.998047       197318       512.00
   14868.479     0.998242       197318       568.89
   14876.671     0.998437       197394       640.00
   14876.671     0.998633       197394       731.43
   14884.863     0.998828       197457       853.33
   14884.863     0.999023       197457      1024.00
   14893.055     0.999121       197512      1137.78
   14893.055     0.999219       197512      1280.00
   14893.055     0.999316       197512      1462.86
   14901.247     0.999414       197557      1706.67
   14901.247     0.999512       197557      2048.00
   14901.247     0.999561       197557      2275.56
   14909.439     0.999609       197592      2560.00
   14909.439     0.999658       197592      2925.71
   14909.439     0.999707       197592      3413.33
   14909.439     0.999756       197592      4096.00
   14917.631     0.999780       197618      4551.11
   14917.631     0.999805       197618      5120.00
   14917.631     0.999829       197618      5851.43
   14917.631     0.999854       197618      6826.67
   14917.631     0.999878       197618      8192.00
   14917.631     0.999890       197618      9102.22
   14925.823     0.999902       197633     10240.00
   14925.823     0.999915       197633     11702.86
   14925.823     0.999927       197633     13653.33
   14925.823     0.999939       197633     16384.00
   14925.823     0.999945       197633     18204.44
   14925.823     0.999951       197633     20480.00
   14925.823     0.999957       197633     23405.71
   14925.823     0.999963       197633     27306.67
   14925.823     0.999969       197633     32768.00
   14934.015     0.999973       197639     36408.89
   14934.015     1.000000       197639          inf
#[Mean    =    12449.206, StdDeviation   =     1348.161]
#[Max     =    14925.824, Total count    =       197639]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  637498 requests in 15.00s, 79.04MB read
Requests/sec:  42499.79
Transfer/sec:      5.27MB